emacs/modes/org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 二 19:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7e265fe">1. Introduction</a></li>
<li><a href="#orgb66d58f">2. Document Structure</a></li>
<li><a href="#orgc1e1bba">3. Tables</a></li>
<li><a href="#orgb321122">4. Hyperlinks</a></li>
<li><a href="#org7227031">5. todo Items</a></li>
<li><a href="#orgdf6829d">6. Tags</a></li>
<li><a href="#orgb08e34a">7. Properties</a></li>
<li><a href="#org36b9ec4">8. Dates and Times</a></li>
<li><a href="#org04ac153">9. Capture - Refile - Archive</a></li>
<li><a href="#orgcb858f6">10. Agenda Views</a></li>
<li><a href="#org3da7425">11. Markup</a></li>
<li><a href="#org69b1fa9">12. Exporting</a></li>
<li><a href="#org019b7c4">13. Publishing</a>
<ul>
<li><a href="#org295b492">13.1. html</a></li>
</ul>
</li>
<li><a href="#orgdb63630">14. Working With Source Code</a>
<ul>
<li><a href="#org1761526">14.1. Structure of Code Blocks</a></li>
<li><a href="#org18fe1df">14.2. Editing source code</a></li>
<li><a href="#org19edfdb">14.3. Evaluating code blocks</a></li>
<li><a href="#org644d44d">14.4. Extracting source code</a></li>
<li><a href="#orgf222088">14.5. Library of Babel</a></li>
<li><a href="#org407e52f">14.6. Header Arguments</a>
<ul>
<li><a href="#orgc6f0772">14.6.1. <code>:VAR</code></a></li>
<li><a href="#orga471948">14.6.2. <code>:results</code></a></li>
<li><a href="#orgc239a18">14.6.3. <code>:session</code></a></li>
<li><a href="#orgf6c21bf">14.6.4. <code>:exports</code></a></li>
<li><a href="#org4648315">14.6.5. <code>:tangle</code></a></li>
<li><a href="#orgbdabbe1">14.6.6. <code>:cache</code></a></li>
<li><a href="#org72144c5">14.6.7. <code>:noweb</code></a></li>
<li><a href="#orgf1059aa">14.6.8. <code>:file</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org184c9c9">15. Miscellaneous</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7e265fe" class="outline-2">
<h2 id="org7e265fe"><span class="section-number-2">1</span> Introduction</h2>
</div>
<div id="outline-container-orgb66d58f" class="outline-2">
<h2 id="orgb66d58f"><span class="section-number-2">2</span> Document Structure</h2>
</div>
<div id="outline-container-orgc1e1bba" class="outline-2">
<h2 id="orgc1e1bba"><span class="section-number-2">3</span> Tables</h2>
</div>
<div id="outline-container-orgb321122" class="outline-2">
<h2 id="orgb321122"><span class="section-number-2">4</span> Hyperlinks</h2>
</div>
<div id="outline-container-org7227031" class="outline-2">
<h2 id="org7227031"><span class="section-number-2">5</span> todo Items</h2>
</div>
<div id="outline-container-orgdf6829d" class="outline-2">
<h2 id="orgdf6829d"><span class="section-number-2">6</span> Tags</h2>
</div>
<div id="outline-container-orgb08e34a" class="outline-2">
<h2 id="orgb08e34a"><span class="section-number-2">7</span> Properties</h2>
</div>
<div id="outline-container-org36b9ec4" class="outline-2">
<h2 id="org36b9ec4"><span class="section-number-2">8</span> Dates and Times</h2>
</div>
<div id="outline-container-org04ac153" class="outline-2">
<h2 id="org04ac153"><span class="section-number-2">9</span> Capture - Refile - Archive</h2>
</div>
<div id="outline-container-orgcb858f6" class="outline-2">
<h2 id="orgcb858f6"><span class="section-number-2">10</span> Agenda Views</h2>
</div>
<div id="outline-container-org3da7425" class="outline-2">
<h2 id="org3da7425"><span class="section-number-2">11</span> Markup</h2>
</div>
<div id="outline-container-org69b1fa9" class="outline-2">
<h2 id="org69b1fa9"><span class="section-number-2">12</span> Exporting</h2>
</div>
<div id="outline-container-org019b7c4" class="outline-2">
<h2 id="org019b7c4"><span class="section-number-2">13</span> Publishing</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org295b492" class="outline-3">
<h3 id="org295b492"><span class="section-number-3">13.1</span> html</h3>
<div class="outline-text-3" id="text-13-1">
<p>
org 在将 org 文件转成 html 文件的时候会可以自动生成 sitemap，但很多时候我们希望 index.html 就是 sitemap。每次更新网站内容的时候可以自动更新 sitemap，也就是 index.html 页面的索引。所以这里 sitemap 生成配置有个小技巧：
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #d18aff;">:auto-sitemap</span> t
<span style="color: #d18aff;">:sitemap-filename</span> <span style="color: #ff4ea3;">"index.html"</span>
</pre>
</div>
<p>
pushlish 文章的时候选择 org-publish-current-project。
</p>
</div>
</div>
</div>
<div id="outline-container-orgdb63630" class="outline-2">
<h2 id="orgdb63630"><span class="section-number-2">14</span> Working With Source Code</h2>
<div class="outline-text-2" id="text-14">
<p>
Org-mode 提供了许多用于处理源代码的功能，包括在其主模式下编辑代码块，代码块求值，导出代码块，以及以多种格式导出代码块及其结果。
</p>
</div>
<div id="outline-container-org1761526" class="outline-3">
<h3 id="org1761526"><span class="section-number-3">14.1</span> Structure of Code Blocks</h3>
<div class="outline-text-3" id="text-14-1">
<p>
代码块的结构如下：
</p>
<pre class="example">
#+NAME: &lt;name&gt;
#+BEGIN_SRC &lt;language&gt; &lt;switches&gt; &lt;header arguments&gt;
  &lt;body&gt;
#+END_SRC
</pre>

<p>
其中 &lt;name&gt; 是用于命名代码块的字符串，&lt;language&gt; 指定代码块的语言（例如 emacs-lisp，shell，R，python 等等），&lt;switches&gt; 可用于控制导出代码块，&lt;header arguments&gt; 可用于控制代码块行为的许多方面，&lt;body&gt; 包含实际的源代码。
</p>
</div>
</div>

<div id="outline-container-org18fe1df" class="outline-3">
<h3 id="org18fe1df"><span class="section-number-3">14.2</span> Editing source code</h3>
<div class="outline-text-3" id="text-14-2">
<p>
使用 <code>C-c '</code> 编辑当前代码块。这将打开一个语言主模式编辑缓冲区，其中包含代码块的主体。保存此缓冲区会将新内容写回 Org 缓冲区。再次使用 <code>C-c '</code> 退出编辑缓冲区。
</p>
</div>
</div>

<div id="outline-container-org19edfdb" class="outline-3">
<h3 id="org19edfdb"><span class="section-number-3">14.3</span> Evaluating code blocks</h3>
<div class="outline-text-3" id="text-14-3">
<p>
使用 <code>C-c C-c</code> 求值当前代码块并将其结果插入组织模式缓冲区。默认情况下，仅对 emacs-lisp 代码块启用求值，但是支持对多种语言的块求值。有关支持的语言的完整列表，请参阅手册。 以下显示了代码块及其结果。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (+ 1 2 3 4)
</pre>
</div>
</div>
</div>

<div id="outline-container-org644d44d" class="outline-3">
<h3 id="org644d44d"><span class="section-number-3">14.4</span> Extracting source code</h3>
<div class="outline-text-3" id="text-14-4">
<p>
使用 <code>C-c C-v t</code> 将当前 buffer 中的代码块保存为纯源代码文件。这被称为 “tangling”&#x2013;采用文学编程社区的术语。在 “tangling” 代码块期间，使用 org-babel-expand-src-block 扩展代码主体，这可以扩展变量和 “noweb” 样式引用。代码块为了 tangle，必须具有 <code>:tangle</code> header 参数，有关详细信息，请参阅手册。
</p>
</div>
</div>

<div id="outline-container-orgf222088" class="outline-3">
<h3 id="orgf222088"><span class="section-number-3">14.5</span> Library of Babel</h3>
<div class="outline-text-3" id="text-14-5">
<p>
使用 <code>C-c C-v l</code> 将 org-mode 文件中的代码块加载到 “Babel 库” 中，然后可以从任何 org-mode buffer 中求值这些块。一组通用的代码块可以通过 Worg 上的 Org-mode 社区驱动文档访问。
</p>
</div>
</div>

<div id="outline-container-org407e52f" class="outline-3">
<h3 id="org407e52f"><span class="section-number-3">14.6</span> Header Arguments</h3>
<div class="outline-text-3" id="text-14-6">
<p>
通过 header 参数控制代码块的求值和导出的许多方面。这些可以在全局，文件级别，outline 子树级别和单个代码块级别指定。以下描述了一些标头参数。
</p>
</div>

<div id="outline-container-orgc6f0772" class="outline-4">
<h4 id="orgc6f0772"><span class="section-number-4">14.6.1</span> <code>:VAR</code></h4>
<div class="outline-text-4" id="text-14-6-1">
<p>
<code>:var</code> 参数用于将参数传递给代码块。传递给参数的值可以是文字值，来自 org-mode 表和文字示例块的值，也可以是其他命名代码块的结果。
</p>
</div>
</div>

<div id="outline-container-orga471948" class="outline-4">
<h4 id="orga471948"><span class="section-number-4">14.6.2</span> <code>:results</code></h4>
<div class="outline-text-4" id="text-14-6-2">
<p>
<code>:results</code> 参数控制代码块结果的集合，类型和处理。output 或 value（默认值）指定如何从代码块的求值中收集结果，vector，scalar，file，raw，html，latex 和 code 的值指定代码块结果的类型，类型指示如何将它们合并到 org-mode 的 buffer 中。silent，replace，prepend 和 append 的值指定代码块结果的处理，特别否应该以及如何将结果插入到 Org-mode 的 buffer 中。
</p>
</div>
</div>

<div id="outline-container-orgc239a18" class="outline-4">
<h4 id="orgc239a18"><span class="section-number-4">14.6.3</span> <code>:session</code></h4>
<div class="outline-text-4" id="text-14-6-3">
<p>
session 将导致在 Emacs 中的持久交互式下级进程中求值代码块。这允许在代码块求值之间保持状态，并且用于手动检查求值结果。
</p>
</div>
</div>

<div id="outline-container-orgf6c21bf" class="outline-4">
<h4 id="orgf6c21bf"><span class="section-number-4">14.6.4</span> <code>:exports</code></h4>
<div class="outline-text-4" id="text-14-6-4">
<p>
可以在导出时保留代码和结果的任何组合，这可以通过将 <code>:exports</code> 参数设置为 code、results、none 或 both 来指定。
</p>
</div>
</div>

<div id="outline-container-org4648315" class="outline-4">
<h4 id="org4648315"><span class="section-number-4">14.6.5</span> <code>:tangle</code></h4>
<div class="outline-text-4" id="text-14-6-5">
<p>
<code>:tangle yes</code> 将导致代码块的内容保存到以 org-mode buffer 的文件名命名的文件中。可以使用以下命令指定文件名 <code>:tangle filename</code> 。
</p>
</div>
</div>

<div id="outline-container-orgbdabbe1" class="outline-4">
<h4 id="orgbdabbe1"><span class="section-number-4">14.6.6</span> <code>:cache</code></h4>
<div class="outline-text-4" id="text-14-6-6">
<p>
<code>:cache yes</code> 将代码块的散列值与结果相关联，确保代码块仅在其输入发生更改时重新运行。
</p>
</div>
</div>

<div id="outline-container-org72144c5" class="outline-4">
<h4 id="org72144c5"><span class="section-number-4">14.6.7</span> <code>:noweb</code></h4>
<div class="outline-text-4" id="text-14-6-7">
<p>
<code>:noweb yes</code> 将求值和 tangle 过程 中扩展 “noweb” 样式引用。
</p>
</div>
</div>

<div id="outline-container-orgf1059aa" class="outline-4">
<h4 id="orgf1059aa"><span class="section-number-4">14.6.8</span> <code>:file</code></h4>
<div class="outline-text-4" id="text-14-6-8">
<p>
将结果输出到文件（例如图形，图表和图形）的代码块可以接受 <code>:file filename</code> 参数，在这种情况下，结果将保存到命名文件，并且文件的链接将插入到 org-mode 的缓冲区。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org184c9c9" class="outline-2">
<h2 id="org184c9c9"><span class="section-number-2">15</span> Miscellaneous</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-10 二 19:58</p>
<p class="validation"></p>
</div>
</body>
</html>
